# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a(n) = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

a1 = int(input("Введите число А: "))
d = int(input("Введите шаг прогрессии: "))
n = int(input("Введите длинну прогрессии: "))
res = []

for i in range(n):
    a = a1 + i * d
    res.append(a)
    
print(res)
